import React from "react";

const CreditHistoryPage = () => {
  return (
    <div className="w-full bg-white pb-20">
      <div className="mx-auto px-4 sm:px-6 md:px-5 lg:px-7 xl:px-10 2xl:px-12 md:max-w-[770px] lg:max-w-[1024px] xl:max-w-[1280px] 2xl:max-w-[1536px] pt-6 lg:pt-10">
        {/* Обертка для сдвига контента на 60px вправо для 2xl */}
        <div className="2xl:ml-[70px]">
          {/* Заголовок страницы */}
         

          {/* Основной текстовый контент */}
          <div className="text-[#1C1C1C] space-y-6 text-[15px] leading-[1.6]">
            <p className="font-bold text-[16px]">
              Կարևոր տեղեկատվություն վարկային պատմության վերաբերյալ
            </p>
            <p>
              Վարկային պարտավորությունները չկատարելը կամ ոչ պատշաճ կատարելը
              կազդի Ձեր ՎԱՐԿԱՅԻՆ ՊԱՏՄՈՒԹՅԱՆ վրա:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Ինչ է վարկային պատմությունը
            </h2>
            <p>
              «Վարկային տեղեկատվության շրջանառության և վարկային բյուրոների
              գործունեության մասին» ՀՀ օրենքի համաձայն վարկային տեղեկատվությունը
              վարկային տեղեկատվության սուբյեկտի կողմից ստանձնած
              պարտավորությունների վերաբերյալ տեղեկատվությունն է, որը ցույց է
              տալիս վարկային տեղեկատվության սուբյեկտի պարտքերը, վճարումները,
              վճարումների սովորությունները կամ պարտավորությունների կամ դրանց
              կատարման վերաբերյալ տեղեկատվություններ:
            </p>
            <p>
              Այն, որպես կանոն, օգտագործվում է ֆինանսական կազմակերպությունների
              կողմից վարկերի տրամադրման, ինչպես նաև արտադրող և վաճառող կամ
              ծառայություններ մատուցող կազմակերպությունների կողմից՝ տարաժամկետ
              վճարման սկզբունքով («ապառիկ») ապրանքների/ծառայությունների իրացման
              վերաբերյալ որոշում կայացնելու ընթացքում:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Որոնք են վարկային պատմության ձևավորման աղբյուրները
            </h2>
            <p>
              Վարկային պատմության ձևավորման աղբյուրներն են ԱՔՌԱ գործընկերները
              (բանկերը, վարկային կազմակերպությունները, ապահովագրական
              ընկերությունները, հետաձգված վճարումներով գործարքներ իրականացնող
              կազմակերպությունները, ինչպես նաև՝ հանրային տվյալների բազաներից ՀՀ
              կառավարության սահմանած կարգով վարկային բյուրոյին անձանց վերաբերյալ
              տեղեկություններ տրամադրող պետական մարмиները), որոնք տրամադրում են
              վարկային տեղեկատվության սուբյեկտի վերաբերյալ
              տեղեկություններ(տվյալներ):
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Ինչ է վարկային բյուրոն
            </h2>
            <p>
              Վարկային բյուրոն իրականացնում է իրավաբանական և ֆիզիկական անձանց
              ֆինանսական պարտավորությունների կատարման վերաբերյալ տեղեկության
              (վարկային տեղեկատվության) հավաքագրում, մշակում, պահպանում,
              տրամադրում, ինչպես նաև դրանց հիման վրա վարկային զեկույցի
              պատրաստման գործունեություն:
            </p>
            <p>
              Վարկային բյուրոյի ծառայությունների շնորհիվ յուրաքանչյուր
              իրավաբանական կամ ֆիզիկական անձ հնարավորություն է ստանում՝
            </p>
            <ul className="list-disc pl-6 space-y-2">
              <li>
                ժամանակին կատարելով իր ֆինանսական պարտավորությունները՝ կերտել
                դրական վարկային պատմություն և օգտագործել այն որպես ծանրակշիռ
                ակտիվ ֆինանսական ծառայություններից արտոնյալ պայմաններով օգտվելու
                համար,
              </li>
              <li>
                ճիշտ կառավարել սեփական ֆինանսական պարտավորությունները և մշտապես
                տեղեկացված լինել սեփական ֆինանսական պարտավորությունների կատարման
                ընդհանուր պատկերի մասին:
              </li>
            </ul>
            <p>
              Վարկային բյուրոյի ծառայությունները թույլ են տալիս վարկատուներին
              (բանկեր, վարկային կազմակերպություններ), ինչպես նաև տարաժամկետ
              վճարման սկզբունքով («ապառիկ») ապրանքներ վաճառող կամ
              ծառայություններ մատուցող կազմակերպություններին կանխելու
              վարկառուների/հաճախորդների կողմից ավելորդ պարտավորությունների
              ստանձնումը, կրճատելու անհուսալի պարտավորությունները և աջակցելու
              պարտավորությունների ժամանակին կատարմանը:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Ինչ է վարկային զեկույցը
            </h2>
            <p>
              Վարկային զեկույցը գրավոր կամ էլեկտրոնային փաստաթուղթ է, որը
              պարունակում է վարկային տեղեկատվության սուբյեկտի (ֆիզիկական կամ
              իրավաբանական) և նրա կողմից ստանձնած տնտեսվարող
              կազմակերպությունների նկատմամբ ֆինանսական պարտավորությունների
              կատարման վերաբերյալ տեղեկատվություն:
              <br />
              Զեկույցը կազմված է ԱՔՌԱ գործընկեր կազմակերպություններից ստացված
              տվյալների հիման վրա և արտացոլում է հարցման պահից վերջին 5 տարվա
              վարկային տվյալները:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Որքան ժամանակ է պահպանվում վարկային պատմությունը
            </h2>
            <p>
              Համաձայն «Վարկային տեղեկատվության շրջանառության և վարկային
              բյուրոների գործունեության մասին» ՀՀ օրենքի 11-րդ հոդվածի
              դրույթների, «վարկային բյուրոյի կողմից տրամադրվող վարկային
              զեկույցներում չպետք է ներառվի վարկային զեկույցի տրամադրման պահին
              նախորդող հինգ տարուց ավելի վարկային տեղեկատվություն»:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Ինչպես բարելավել վարկային պատմությունը
            </h2>
            <p>
              Նախ, անհրաժեշտ է լիովին մարել նախկինում գոյացած ժամկետանց
              պարտավորությունների վճարումները: Բացի այդ, ներկա պահին գործող
              վարկերի մասով անհրաժեշտ է բացառել ժամկետանց՝ նույնիսկ մեկ օրվա
              կտրվածքով պարտավորությունների գոյացումը:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Ուր դիմել եթե վարկային պատմությունը սխալ է
            </h2>
            <p>
              Եթե վարկառուի վարկային պատմության մեջ առկա են սխալ կամ թերի
              տվյալներ, ապա պարզաբանման և ուղղման նպատակով վարկառուն՝ համաձայն
              «Վարկային տեղեկատվության շրջանառության և վարկային բյուրոների
              գործունեության մասին» ՀՀ օրենքի 20-րդ հոդվածի դրույթների, կարող է
              այդ մասին տեղեկացնել վարկային բյուրոյին կամ ուղղակիորեն դիմել
              տեղեկատվություն տրամադրող սուբյեկտներին (վարկային տեղեկատվության
              աղբյուրին): Տեղեկացումը կարող է իրականացվել համապատասխան գրավոր
              դիմում վարկային բյուրոյին ներկայացնելու միջոցով կամ էլեկտրոնային
              եղանակով՝ առցանց ռեժիմում Իմ ԱՔՌԱ անձնական գրասենյակից: ԱՔՌԱ-ի
              կողմից տրամադրված վարկային զեկույցների վերաբերյալ հաճախորդների
              բողոքների ընդունման/ստացման, քննարկման և վերջիններիս արձագանքման
              գործընթացը, գործողությունների հաջորդականությունը սահմանվում է
              «ԱՔՌԱ Քրեդիտ Ռեփորթինգ» ՓԲԸ-ի «Վեճերի լուծման ընթացակարգ»-ով:
            </p>

            <h2 className="font-bold text-[18px] mt-8">
              Վարկի տրամադրման վերաբերյալ որոշման կայացման չափանիշները
            </h2>
            <p className="font-bold mt-4">
              Դրական որոշման կայացման չափանիշները`
            </p>
            <ul className="list-disc pl-6 space-y-2">
              <li>
                Մեր կողմից ընդունելի գրավադրվող գույքը և երաշխավորությունները,
              </li>
              <li>Մշտական բնակության վայրը,</li>
              <li>Կայուն եկամտի աղբյուրը,</li>
              <li>Դրական կամ չեզոք վարկային պատմությունը,</li>
              <li>Արժանահավատ և լիարժեք փաստաթղթերը:</li>
            </ul>

            <p className="font-bold mt-4">
              Բացասական որոշման կայացման չափանիշները`
            </p>
            <ul className="list-disc pl-6 space-y-2">
              <li>Ոչ արժանահավատ փաստաթղթերը ներկայացնելը,</li>
              <li>Բացասական վարկային պատմությունը,</li>
              <li>
                Եկամտի աղբյուրի ռիսկայնությունը (անկայուն եկամուտներ, ոչ հստակ
                պարբերականությամբ եկամուտներ),
              </li>
              <li>
                Գրավի պայմանագրի կամ երաշխավորության համաձայնագրերի կնքման համար
                անհրաժեշտ փաստաթղթեր չներկայացնելը:
              </li>
            </ul>

            <h2 className="font-bold text-[18px] mt-8">Վարկային սքոր</h2>
            <p>
              Բանկը կիրառում է իր կողմից մշակված վարկային սքորը վարկավորման
              վերաբերյալ որոշումների կայացման ժամանակ։ Վարկային սքորը հաճախորդի
              վարկային պատմության և որոկական ցուցանիշների ուսումնասիրության
              հիման վրա ձևավորվող վիճակագրական գնահատականն է, որն արտահայտում է
              հավանականությունը հայցվող վարկը ժամանակին և պատշաճ մարելու գծով։
              Վարկային պատմությունը ներառվում է սքորի հաշվարկի մեջ դիմելու պահից
              վերջին 5 տարվա վաղեմությամբ։
            </p>
            <p>
              Բանկի ներքին սքոր գնահատականի վրա ազդող հիմնական գործոններն են՝
              ՖԱՅԿՈ սքորը (բարձր ՖԱՅԿՈ սքոր - դրական ազդեցություն), գործող
              վարկերի քանակը (գործող վարկերի քանակի ավելացում – բացասական
              ազդեցություն), վարկային բեռը (բարձր վարկային բեռ – բացասական
              ազդեցություն), վարկային պարտավորությունների ժամանակին կատարման
              փաստը (ժամկետանցների առկայություն – բացասական ազդեցություն), նոր
              վարկային հայտեր ներկայացնելու հաճախականությունը (հայտերի քանակի
              ավելացում – բացասական ազդեցություն), հաճախորդի աշխատանքային փորձը
              (քիչ փորձառություն – բացասական ազդեցություն), եկամուտների
              մեծությունը (բարձր եկամուտների առկայություն – դրական
              ազդեցություն)։
            </p>
            <p>
              Վարկային պատմությունը և/կամ սքոր գնահատականը հնարավոր է բարելավվել
              վարկն առանց ժամկետանցների մարելու, նպատակային օգտագործելու,
              վարկերի մնացորդային գումարը և քանակը նվազեցնելու, տրված
              երաշխավորությունների գծով պարտավորությունները ժամանակին կատարելու
              դեպքում։
            </p>
            <p>
              Վարկային պատմության և սքոր վատթարացումից խուսափելու նպատակով
              հաճախորդները չպետք է ունենան ժամկետանցներ, անհիմն ավելացնեն
              վարկային ծանրաբեռնվածությունը, վարկերի քանակը, հաճախակի
              վարկավորման հարցումներ ուղարկեն տարբեր կազմակերպություններին,
              հանդիսանան երաշխավոր անվստահելի անձանց համար։
            </p>
            <p>
              Վարկային պատմության և ՖԱՅԿՈ սքորի վերաբերյալ առավել մանրամասն
              տեղեկատվություն կարելի է ստանալ այցելելով՝{" "}
              <a
                href="https://www.abcfinance.am"
                target="_blank"
                rel="noopener noreferrer"
                className="text-[#5800EB] hover:underline"
              >
                https://www.abcfinance.am
              </a>
              , Հաճախ տրվող հարցեր -{" "}
              <a
                href="https://acra.am"
                target="_blank"
                rel="noopener noreferrer"
                className="text-[#5800EB] hover:underline"
              >
                ԱՔՌԱ (acra.am)
              </a>{" "}
              և{" "}
              <a
                href="http://www.acra.am"
                target="_blank"
                rel="noopener noreferrer"
                className="text-[#5800EB] hover:underline"
              >
                www.acra.am
              </a>{" "}
              կայքեր։
            </p>
          </div>

          {/* Блок "Документы" (Փաստաթղթեր) */}
          <div className="mt-16 border-t border-gray-100 pt-10">
            <h2 className="text-[22px] font-bold text-[#1C1C1C] mb-6">
              Փաստաթղթեր
            </h2>

            <a
              href="#"
              className="flex items-center gap-4 bg-[#fbf9ff] hover:bg-[#f3edfc] transition-colors p-4 rounded-lg md:w-max min-w-full md:min-w-[600px] border border-transparent hover:border-[#5800EB]/10"
            >
              {/* Иконка документа (SVG) */}
              <div className="shrink-0">
                <svg
                  width="28"
                  height="32"
                  viewBox="0 0 24 28"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M15 2H5.00001C3.89544 2 3.00001 2.89543 3.00001 4V24C3.00001 25.1046 3.89544 26 5.00001 26H19C20.1046 26 21 25.1046 21 24V8L15 2Z"
                    stroke="#8B3DFF"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                  <path
                    d="M15 2V8H21"
                    stroke="#8B3DFF"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                  <circle
                    cx="12"
                    cy="17"
                    r="4"
                    stroke="#8B3DFF"
                    strokeWidth="2"
                  />
                  <path
                    d="M12 15V19M12 19L10 17M12 19L14 17"
                    stroke="#8B3DFF"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </svg>
              </div>

              <span className="font-bold text-[15px] text-[#1C1C1C]">
                Տեղեկատվական ամփոփագիր (Վարկային պրոդուկտներ) 07.04.2026
              </span>
            </a>
          </div>
        </div>
      </div>
    </div>
  );
};

export default CreditHistoryPage;
